#if 0
;
; Note: shader requires additional functionality:
;       Double-precision floating point
;       UAVs at every shader stage
;
; shader debug name: ca839a20d4e2b9482dd4a628f0f3a187.pdb
; shader hash: ca839a20d4e2b9482dd4a628f0f3a187
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; scene                             texture     i32         ras      T0             t0     1
; uav                                   UAV     f32          2d      U0             u0     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%struct.RaytracingAccelerationStructure = type { i32 }
%"class.RWTexture2D<vector<float, 4> >" = type { <4 x float> }
%struct.RayDesc = type { <3 x float>, float, <3 x float>, float }
%struct.Payload = type { <3 x float>, i32, i32 }
%dx.types.Handle = type { i8* }
%struct.BuiltInTriangleIntersectionAttributes = type { <2 x float> }

@"\01?scene@@3URaytracingAccelerationStructure@@A" = external constant %struct.RaytracingAccelerationStructure, align 4
@"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A" = external constant %"class.RWTexture2D<vector<float, 4> >", align 4
@dx.nothing.a = internal constant [1 x i32] zeroinitializer

; Function Attrs: nounwind

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !48, globals: !80)
!1 = !DIFile(filename: "src\5Cshader\5Cshader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !24, !33}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 34, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 34, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 34, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 54, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 54, size: 128, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !19, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 54, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !16, file: !1, line: 54, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!12, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 110, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 110, size: 96, align: 32, elements: !26, templateParams: !31)
!26 = !{!27, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 110, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 110, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 110, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!32, !13}
!32 = !DITemplateTypeParameter(name: "element", type: !28)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 111, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 111, size: 288, align: 32, elements: !35, templateParams: !45)
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !34, file: !1, line: 111, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !34, file: !1, line: 111, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !34, file: !1, line: 111, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !34, file: !1, line: 111, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !34, file: !1, line: 111, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !34, file: !1, line: 111, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !34, file: !1, line: 111, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !34, file: !1, line: 111, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !34, file: !1, line: 111, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!45 = !{!12, !46, !47}
!46 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!47 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!48 = !{!49, !52, !62, !74, !78, !79}
!49 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 26, type: !50, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!50 = !DISubroutineType(types: !51)
!51 = !{null}
!52 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXUPayload@@@Z", scope: !1, file: !1, line: 62, type: !53, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z")
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55}
!55 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "Payload", file: !1, line: 2, size: 160, align: 32, elements: !57)
!57 = !{!58, !59, !61}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !56, file: !1, line: 4, baseType: !4, size: 96, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "allowReflection", scope: !56, file: !1, line: 5, baseType: !60, size: 32, align: 32, offset: 96)
!60 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "missed", scope: !56, file: !1, line: 6, baseType: !60, size: 32, align: 32, offset: 128)
!62 = !DISubprogram(name: "ClosestHit", linkageName: "\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 82, type: !63, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!63 = !DISubroutineType(types: !64)
!64 = !{null, !55, !65}
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 70, size: 64, align: 32, elements: !66)
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !65, file: !1, line: 70, baseType: !68, size: 64, align: 32)
!68 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 30, size: 64, align: 32, elements: !69, templateParams: !72)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !68, file: !1, line: 30, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !68, file: !1, line: 30, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!72 = !{!12, !73}
!73 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!74 = !DISubprogram(name: "HitCube", linkageName: "\01?HitCube@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 105, type: !75, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !55, !77}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 30, baseType: !68)
!78 = !DISubprogram(name: "HitMirror", linkageName: "\01?HitMirror@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 127, type: !75, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubprogram(name: "HitFloor", linkageName: "\01?HitFloor@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 157, type: !75, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: false)
!80 = !{!81, !83, !87, !89, !90, !91, !92, !94, !96, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!81 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 10, type: !82, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 10, size: 32, align: 32, elements: !2)
!83 = !DIGlobalVariable(name: "uav", linkageName: "\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 13, type: !84, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!84 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 13, size: 128, align: 32, elements: !2, templateParams: !85)
!85 = !{!86}
!86 = !DITemplateTypeParameter(name: "element", type: !16)
!87 = !DIGlobalVariable(name: "camera", scope: !0, file: !1, line: 16, type: !88, isLocal: true, isDefinition: true)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!89 = !DIGlobalVariable(name: "light", scope: !0, file: !1, line: 17, type: !88, isLocal: true, isDefinition: true)
!90 = !DIGlobalVariable(name: "skyTop", scope: !0, file: !1, line: 18, type: !88, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariable(name: "skyBottom", scope: !0, file: !1, line: 19, type: !88, isLocal: true, isDefinition: true)
!92 = !DIGlobalVariable(name: "skyTop.1", linkageName: "skyTop.1", scope: !0, file: !1, line: 18, type: !93, isLocal: false, isDefinition: true)
!93 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !88, size: 32, align: 4, offset: 32)
!94 = !DIGlobalVariable(name: "skyBottom.0", linkageName: "skyBottom.0", scope: !0, file: !1, line: 19, type: !95, isLocal: false, isDefinition: true)
!95 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !88, size: 32, align: 4)
!96 = !DIGlobalVariable(name: "skyBottom.2", linkageName: "skyBottom.2", scope: !0, file: !1, line: 19, type: !97, isLocal: false, isDefinition: true)
!97 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !88, size: 32, align: 4, offset: 64)
!98 = !DIGlobalVariable(name: "camera.1", linkageName: "camera.1", scope: !0, file: !1, line: 16, type: !93, isLocal: false, isDefinition: true)
!99 = !DIGlobalVariable(name: "light.1", linkageName: "light.1", scope: !0, file: !1, line: 17, type: !93, isLocal: false, isDefinition: true)
!100 = !DIGlobalVariable(name: "camera.0", linkageName: "camera.0", scope: !0, file: !1, line: 16, type: !95, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariable(name: "light.0", linkageName: "light.0", scope: !0, file: !1, line: 17, type: !95, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariable(name: "skyTop.0", linkageName: "skyTop.0", scope: !0, file: !1, line: 18, type: !95, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariable(name: "light.2", linkageName: "light.2", scope: !0, file: !1, line: 17, type: !97, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariable(name: "skyBottom.1", linkageName: "skyBottom.1", scope: !0, file: !1, line: 19, type: !93, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariable(name: "skyTop.2", linkageName: "skyTop.2", scope: !0, file: !1, line: 18, type: !97, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariable(name: "camera.2", linkageName: "camera.2", scope: !0, file: !1, line: 16, type: !97, isLocal: false, isDefinition: true)
!107 = !{i32 2, !"Dwarf Version", i32 4}
!108 = !{i32 2, !"Debug Info Version", i32 3}
!109 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!110 = !{!"src\5Cshader\5Cshader.hlsl", !"// Payload struct passed along rays.\0D\0Astruct Payload\0D\0A{\0D\0A    float3 color;\0D\0A    bool allowReflection;\0D\0A    bool missed;\0D\0A};\0D\0A\0D\0A// Scene acceleration structure (TLAS).\0D\0ARaytracingAccelerationStructure scene : register(t0);\0D\0A\0D\0A// UAV target to write final colours.\0D\0ARWTexture2D<float4> uav : register(u0);\0D\0A\0D\0A// Constants for camera position and lighting.\0D\0Astatic const float3 camera = float3(0, 1.5, -7);\0D\0Astatic const float3 light = float3(0, 200, 0);\0D\0Astatic const float3 skyTop = float3(0.24, 0.44, 0.72);\0D\0Astatic const float3 skyBottom = float3(0.75, 0.86, 0.93);\0D\0A\0D\0A// -----------------------------------------------------------------------------\0D\0A// RAY GENERATION SHADER\0D\0A// -----------------------------------------------------------------------------\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGeneration()\0D\0A{\0D\0A    // Get current pixel coordinate and screen size.\0D\0A    uint2 idx = DispatchRaysIndex().xy;\0D\0A    float2 size = DispatchRaysDimensions().xy;\0D\0A    \0D\0A    // Compute UV coordinate and generate a ray toward the scene.\0D\0A    float2 uv = idx / size;\0D\0A    float3 target = float3((uv.x * 2 - 1) * 1.8 * (size.x / size.y),\0D\0A                           (1 - uv.y) * 4 - 2 + camera.y,\0D\0A                           0);\0D\0A    \0D\0A    // Set up the ray description.\0D\0A    RayDesc ray;\0D\0A    ray.Origin = camera;\0D\0A    ray.Direction = target - camera;\0D\0A    ray.TMin = 0.001;\0D\0A    ray.TMax = 1000;\0D\0A    \0D\0A    // Initialize the payload.\0D\0A    Payload payload;\0D\0A    payload.allowReflection = true; // Only allow one reflection per ray.\0D\0A    payload.missed = false;\0D\0A    \0D\0A    // Trace the ray through the scene.\0D\0A    TraceRay(scene, 0x00, 0xFF, 0, 0, 0, ray, payload);\0D\0A    \0D\0A    // Write the final colour to the output image.\0D\0A    uav[idx] = float4(payload.color, 1);\0D\0A}\0D\0A\0D\0A// -----------------------------------------------------------------------------\0D\0A// MISS SHADER\0D\0A// -----------------------------------------------------------------------------\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout Payload payload)\0D\0A{\0D\0A    // Fade from horizon colour to sky colour based on the ray direction.\0D\0A    float slope = normalize(WorldRayDirection()).y;\0D\0A    float t = saturate(slope * 5 + 0.5);\0D\0A    payload.color = lerp(skyBottom, skyTop, t);\0D\0A    \0D\0A    payload.missed = true;\0D\0A}\0D\0A\0D\0A// -----------------------------------------------------------------------------\0D\0A// CLOSEST HIT SHADER\0D\0A// -----------------------------------------------------------------------------\0D\0A\0D\0A// Forward declarations for per-instance material logic.\0D\0Avoid HitCube(inout Payload payload, float2 uv);\0D\0Avoid HitMirror(inout Payload payload, float2 uv);\0D\0Avoid HitFloor(inout Payload payload, float2 uv);\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ClosestHit(inout Payload payload, BuiltInTriangleIntersectionAttributes attribs)\0D\0A{\0D\0A    float2 uv = attribs.barycentrics;\0D\0A    \0D\0A    // Select shading behaviour based on instance ID.\0D\0A    switch (InstanceID())\0D\0A    {\0D\0A        case 0:\0D\0A            HitCube(payload, uv);\0D\0A            break;\0D\0A        case 1:\0D\0A            HitMirror(payload, uv);\0D\0A            break;\0D\0A        case 2:\0D\0A            HitFloor(payload, uv);\0D\0A            break;\0D\0A        default:\0D\0A            payload.color = float3(1, 0, 1); // Debug magenta for unknown instance.\0D\0A            break;\0D\0A    }\0D\0A}\0D\0A\0D\0A// Cube shader with normal-based colouring and face borders.\0D\0Avoid HitCube(inout Payload payload, float2 uv)\0D\0A{\0D\0A    // Estimate face normal from primitive index.\0D\0A    uint tri = PrimitiveIndex();\0D\0A    tri /= 2;\0D\0A    float3 normal = (tri.xxx % 3 == uint3(0, 1, 2)) * (tri < 3 ? -1 : 1);\0D\0A    float3 worldNormal = normalize(mul(normal, (float3x3) ObjectToWorld4x3()));\0D\0A    \0D\0A    // Base colour from absolute normal components.\0D\0A    float3 color = abs(normal) / 3 + 0.5;\0D\0A    if (uv.x < 0.03 || uv.y < 0.03)\0D\0A    {\0D\0A        color = 0.25.rrr;\0D\0A    }\0D\0A    \0D\0A    // Simple directional lighting.\0D\0A    color *= saturate(dot(worldNormal, normalize(light))) + 0.33;\0D\0A    \0D\0A    payload.color = color;\0D\0A}\0D\0A\0D\0A// Mirror shader with one-bounce recursive reflection.\0D\0Avoid HitMirror(inout Payload payload, float2 uv)\0D\0A{\0D\0A    // Stop reflecting if recursion not allowed.\0D\0A    if (!payload.allowReflection)\0D\0A    {\0D\0A        return;\0D\0A    }\0D\0A    \0D\0A    // Compute world-space hit position and surface normal.\0D\0A    float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    float3 normal = normalize(mul(float3(0, 1, 0), (float3x3)ObjectToWorld4x3()));\0D\0A    \0D\0A    // Reflect ray direction around normal.\0D\0A    float3 reflected = reflect(normalize(WorldRayDirection()), normal);\0D\0A    \0D\0A    // Construct a new ray.\0D\0A    RayDesc mirrorRay;\0D\0A    mirrorRay.Origin = pos;\0D\0A    mirrorRay.Direction = reflected;\0D\0A    mirrorRay.TMin = 0.001;\0D\0A    mirrorRay.TMax = 1000;\0D\0A    \0D\0A    // Prevent further reflection.\0D\0A    payload.allowReflection = false;\0D\0A    \0D\0A    // Trace the reflected ray with same payload.\0D\0A    TraceRay(scene, 0x00, 0xFF, 0, 0, 0, mirrorRay, payload);\0D\0A}\0D\0A\0D\0A// Floor shader with checkerboard pattern and shadow ray.\0D\0Avoid HitFloor(inout Payload payload, float2 uv)\0D\0A{ \0D\0A    float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A    \0D\0A    // Checkerboard pattern using world-space XZ coordinates.\0D\0A    bool2 pattern = frac(pos.xz) > 0.5;\0D\0A    payload.color = (pattern.x ^ pattern.y ? 0.6 : 0.4).rrr;\0D\0A\0D\0A    // Shadow ray setup.\0D\0A    RayDesc shadowRay;\0D\0A    shadowRay.Origin = pos;\0D\0A    shadowRay.Direction = light - pos;\0D\0A    shadowRay.TMin = 0.001;\0D\0A    shadowRay.TMax = 1;\0D\0A    \0D\0A    // Trace a shadow ray to see if light is blocked.\0D\0A    Payload shadow;\0D\0A    shadow.allowReflection = false;\0D\0A    shadow.missed = false;\0D\0A    TraceRay(scene, 0x00, 0xFF, 0, 0, 0, shadowRay, shadow);\0D\0A    \0D\0A    // If the shadow ray hit something, darken the colour.\0D\0A    if (!shadow.missed)\0D\0A    {\0D\0A        payload.color /= 2;\0D\0A    }\0D\0A}"}
!111 = !{!"src\5Cshader\5Cshader.hlsl"}
!112 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/Fo", !"C:\5Cdev\5CRenderingEngine2\5Cbin\5CDebug\5Cshader.cso", !"/Od", !"/Zi", !"/Qembed_debug"}
!113 = !{i32 1, i32 3}
!114 = !{i32 1, i32 6}
!115 = !{!"lib", i32 6, i32 3}
!116 = !{!117, !120, null, null}
!117 = !{!118}
!118 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?scene@@3URaytracingAccelerationStructure@@A", !"scene", i32 0, i32 0, i32 1, i32 16, i32 0, !119}
!119 = !{i32 0, i32 4}
!120 = !{!121}
!121 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"uav", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !122}
!122 = !{i32 0, i32 9}
!123 = !{i32 0, %struct.RayDesc undef, !124, %struct.Payload undef, !129, %struct.BuiltInTriangleIntersectionAttributes undef, !133}
!124 = !{i32 32, !125, !126, !127, !128}
!125 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!126 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!127 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!128 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!129 = !{i32 20, !130, !131, !132}
!130 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!131 = !{i32 6, !"allowReflection", i32 3, i32 12, i32 7, i32 1}
!132 = !{i32 6, !"missed", i32 3, i32 16, i32 7, i32 1}
!133 = !{i32 8, !134}
!134 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!135 = !{i32 1, void ()* @"\01?RayGeneration@@YAXXZ", !136, void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !138, void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !140}
!136 = !{!137}
!137 = !{i32 1, !2, !2}
!138 = !{!137, !139}
!139 = !{i32 2, !2, !2}
!140 = !{!137, !139, !141}
!141 = !{i32 0, !2, !2}
!142 = !{null, !"", null, !116, !143}
!143 = !{i32 0, i64 65541}
!144 = !{void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !145}
!145 = !{i32 8, i32 10, i32 6, i32 20, i32 7, i32 8, i32 5, !146}
!146 = !{i32 0}
!147 = !{void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !"\01?Miss@@YAXUPayload@@@Z", null, null, !148}
!148 = !{i32 8, i32 11, i32 6, i32 20, i32 5, !146}
!149 = !{void ()* @"\01?RayGeneration@@YAXXZ", !"\01?RayGeneration@@YAXXZ", null, null, !150}
!150 = !{i32 8, i32 7, i32 5, !146}
!151 = !DILocation(line: 51, column: 5, scope: !49)
!152 = !DILocation(line: 54, column: 5, scope: !49)
!153 = !DILocation(line: 29, column: 17, scope: !49)
!154 = !DILocation(line: 29, column: 11, scope: !49)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !49, file: !1, line: 29, type: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 29, baseType: !157)
!157 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 29, size: 64, align: 32, elements: !158, templateParams: !161)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !157, file: !1, line: 29, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !157, file: !1, line: 29, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!161 = !{!32, !73}
!162 = !DIExpression(DW_OP_bit_piece, 0, 32)
!163 = !DIExpression(DW_OP_bit_piece, 32, 32)
!164 = !DILocation(line: 30, column: 19, scope: !49)
!165 = !DILocation(line: 30, column: 12, scope: !49)
!166 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !49, file: !1, line: 30, type: !77)
!167 = !DILocation(line: 33, column: 17, scope: !49)
!168 = !DILocation(line: 33, column: 21, scope: !49)
!169 = !DILocation(line: 33, column: 12, scope: !49)
!170 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !49, file: !1, line: 33, type: !77)
!171 = !DILocation(line: 34, column: 34, scope: !49)
!172 = !DILocation(line: 34, column: 38, scope: !49)
!173 = !DILocation(line: 34, column: 43, scope: !49)
!174 = !DILocation(line: 34, column: 59, scope: !49)
!175 = !DILocation(line: 34, column: 49, scope: !49)
!176 = !DILocation(line: 35, column: 31, scope: !49)
!177 = !DILocation(line: 35, column: 39, scope: !49)
!178 = !DILocation(line: 35, column: 43, scope: !49)
!179 = !DILocation(line: 35, column: 49, scope: !49)
!180 = !DILocation(line: 35, column: 47, scope: !49)
!181 = !DILocation(line: 34, column: 12, scope: !49)
!182 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !49, file: !1, line: 34, type: !4)
!183 = !DIExpression(DW_OP_bit_piece, 64, 32)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !49, file: !1, line: 39, type: !185)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 39, size: 256, align: 32, elements: !186)
!186 = !{!187, !188, !189, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !185, file: !1, line: 39, baseType: !5, size: 96, align: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !185, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 96)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !185, file: !1, line: 39, baseType: !5, size: 96, align: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !185, file: !1, line: 39, baseType: !8, size: 32, align: 32, offset: 224)
!191 = !DIExpression()
!192 = !DILocation(line: 39, column: 13, scope: !49)
!193 = !DILocation(line: 40, column: 18, scope: !49)
!194 = !DILocation(line: 40, column: 9, scope: !49)
!195 = !DILocation(line: 40, column: 16, scope: !49)
!196 = !DILocation(line: 41, column: 30, scope: !49)
!197 = !DILocation(line: 41, column: 28, scope: !49)
!198 = !DILocation(line: 41, column: 9, scope: !49)
!199 = !DILocation(line: 41, column: 19, scope: !49)
!200 = !DILocation(line: 42, column: 9, scope: !49)
!201 = !DILocation(line: 42, column: 14, scope: !49)
!202 = !DILocation(line: 43, column: 9, scope: !49)
!203 = !DILocation(line: 43, column: 14, scope: !49)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !49, file: !1, line: 46, type: !56)
!205 = !DILocation(line: 46, column: 13, scope: !49)
!206 = !DILocation(line: 47, column: 13, scope: !49)
!207 = !DILocation(line: 47, column: 29, scope: !49)
!208 = !DILocation(line: 48, column: 13, scope: !49)
!209 = !DILocation(line: 48, column: 20, scope: !49)
!210 = !DILocation(line: 54, column: 31, scope: !49)
!211 = !DILocation(line: 54, column: 22, scope: !49)
!212 = !DILocation(line: 54, column: 14, scope: !49)
!213 = !DILocation(line: 55, column: 1, scope: !49)
!214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !52, file: !1, line: 62, type: !56)
!215 = !DIExpression(DW_OP_bit_piece, 96, 32)
!216 = !DILocation(line: 62, column: 25, scope: !52)
!217 = !DILocation(line: 65, column: 29, scope: !52)
!218 = !DILocation(line: 65, column: 19, scope: !52)
!219 = !DILocation(line: 65, column: 11, scope: !52)
!220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slope", scope: !52, file: !1, line: 65, type: !8)
!221 = !DILocation(line: 66, column: 30, scope: !52)
!222 = !DILocation(line: 66, column: 34, scope: !52)
!223 = !DILocation(line: 66, column: 15, scope: !52)
!224 = !DILocation(line: 66, column: 11, scope: !52)
!225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !52, file: !1, line: 66, type: !8)
!226 = !DILocation(line: 67, column: 37, scope: !52)
!227 = !DILocation(line: 67, column: 26, scope: !52)
!228 = !DILocation(line: 67, column: 21, scope: !52)
!229 = !DILocation(line: 67, column: 19, scope: !52)
!230 = !DILocation(line: 69, column: 20, scope: !52)
!231 = !DIExpression(DW_OP_bit_piece, 128, 32)
!232 = !DILocation(line: 70, column: 1, scope: !52)
!233 = !DILocation(line: 176, column: 5, scope: !79, inlinedAt: !234)
!234 = distinct !DILocation(line: 96, column: 13, scope: !235)
!235 = distinct !DILexicalBlock(scope: !62, file: !1, line: 88, column: 5)
!236 = !{!237}
!237 = distinct !{!237, !238, !"\01?HitFloor@@YAXUPayload@@V?$vector@M$01@@@Z: %payload"}
!238 = distinct !{!238, !"\01?HitFloor@@YAXUPayload@@V?$vector@M$01@@@Z"}
!239 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attribs", arg: 2, scope: !62, file: !1, line: 82, type: !65)
!240 = !DILocation(line: 82, column: 78, scope: !62)
!241 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !62, file: !1, line: 82, type: !56)
!242 = !DILocation(line: 82, column: 31, scope: !62)
!243 = !DILocation(line: 84, column: 25, scope: !62)
!244 = !DILocation(line: 84, column: 12, scope: !62)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !62, file: !1, line: 84, type: !77)
!246 = !DILocation(line: 87, column: 13, scope: !62)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mirrorRay", scope: !78, file: !1, line: 143, type: !185)
!248 = !DILocation(line: 143, column: 13, scope: !78, inlinedAt: !249)
!249 = distinct !DILocation(line: 93, column: 13, scope: !235)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shadowRay", scope: !79, file: !1, line: 166, type: !185)
!251 = !DILocation(line: 166, column: 13, scope: !79, inlinedAt: !234)
!252 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shadow", scope: !79, file: !1, line: 173, type: !56)
!253 = !DILocation(line: 173, column: 13, scope: !79, inlinedAt: !234)
!254 = !DILocation(line: 87, column: 5, scope: !62)
!255 = !DILocation(line: 90, column: 13, scope: !235)
!256 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uv", arg: 2, scope: !74, file: !1, line: 105, type: !77)
!257 = !DILocation(line: 105, column: 44, scope: !74, inlinedAt: !258)
!258 = distinct !DILocation(line: 90, column: 13, scope: !235)
!259 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !74, file: !1, line: 105, type: !56)
!260 = !DILocation(line: 105, column: 28, scope: !74, inlinedAt: !258)
!261 = !DILocation(line: 108, column: 16, scope: !74, inlinedAt: !258)
!262 = !DILocation(line: 108, column: 10, scope: !74, inlinedAt: !258)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tri", scope: !74, file: !1, line: 108, type: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 108, baseType: !28)
!265 = !DILocation(line: 109, column: 9, scope: !74, inlinedAt: !258)
!266 = !DILocation(line: 110, column: 30, scope: !74, inlinedAt: !258)
!267 = !DILocation(line: 110, column: 34, scope: !74, inlinedAt: !258)
!268 = !DILocation(line: 110, column: 21, scope: !74, inlinedAt: !258)
!269 = !DILocation(line: 110, column: 60, scope: !74, inlinedAt: !258)
!270 = !DILocation(line: 110, column: 55, scope: !74, inlinedAt: !258)
!271 = !DILocation(line: 110, column: 53, scope: !74, inlinedAt: !258)
!272 = !DILocation(line: 110, column: 12, scope: !74, inlinedAt: !258)
!273 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "normal", scope: !74, file: !1, line: 110, type: !4)
!274 = !DILocation(line: 111, column: 59, scope: !74, inlinedAt: !258)
!275 = !DILocation(line: 111, column: 36, scope: !74, inlinedAt: !258)
!276 = !DILocation(line: 111, column: 26, scope: !74, inlinedAt: !258)
!277 = !DILocation(line: 111, column: 12, scope: !74, inlinedAt: !258)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "worldNormal", scope: !74, file: !1, line: 111, type: !4)
!279 = !DILocation(line: 114, column: 20, scope: !74, inlinedAt: !258)
!280 = !DILocation(line: 114, column: 32, scope: !74, inlinedAt: !258)
!281 = !DILocation(line: 114, column: 36, scope: !74, inlinedAt: !258)
!282 = !DILocation(line: 114, column: 12, scope: !74, inlinedAt: !258)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !74, file: !1, line: 114, type: !4)
!284 = !DILocation(line: 115, column: 9, scope: !285, inlinedAt: !258)
!285 = distinct !DILexicalBlock(scope: !74, file: !1, line: 115, column: 9)
!286 = !DILocation(line: 115, column: 14, scope: !285, inlinedAt: !258)
!287 = !DILocation(line: 115, column: 24, scope: !285, inlinedAt: !258)
!288 = !DILocation(line: 115, column: 29, scope: !285, inlinedAt: !258)
!289 = !DILocation(line: 115, column: 21, scope: !285, inlinedAt: !258)
!290 = !DILocation(line: 115, column: 9, scope: !74, inlinedAt: !258)
!291 = !DILocation(line: 117, column: 17, scope: !292, inlinedAt: !258)
!292 = distinct !DILexicalBlock(scope: !285, file: !1, line: 116, column: 5)
!293 = !DILocation(line: 117, column: 15, scope: !292, inlinedAt: !258)
!294 = !DILocation(line: 118, column: 5, scope: !292, inlinedAt: !258)
!295 = !DILocation(line: 121, column: 50, scope: !74, inlinedAt: !258)
!296 = !DILocation(line: 121, column: 23, scope: !74, inlinedAt: !258)
!297 = !DILocation(line: 121, column: 14, scope: !74, inlinedAt: !258)
!298 = !DILocation(line: 121, column: 59, scope: !74, inlinedAt: !258)
!299 = !DILocation(line: 121, column: 11, scope: !74, inlinedAt: !258)
!300 = !DILocation(line: 123, column: 13, scope: !74, inlinedAt: !258)
!301 = !DILocation(line: 123, column: 19, scope: !74, inlinedAt: !258)
!302 = !{!303}
!303 = distinct !{!303, !304, !"\01?HitCube@@YAXUPayload@@V?$vector@M$01@@@Z: %payload"}
!304 = distinct !{!304, !"\01?HitCube@@YAXUPayload@@V?$vector@M$01@@@Z"}
!305 = !DILocation(line: 124, column: 1, scope: !74, inlinedAt: !258)
!306 = !DILocation(line: 91, column: 13, scope: !235)
!307 = !DILocation(line: 93, column: 13, scope: !235)
!308 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !78, file: !1, line: 127, type: !56)
!309 = !DILocation(line: 127, column: 30, scope: !78, inlinedAt: !249)
!310 = !DILocation(line: 130, column: 18, scope: !311, inlinedAt: !249)
!311 = distinct !DILexicalBlock(scope: !78, file: !1, line: 130, column: 9)
!312 = !{!313}
!313 = distinct !{!313, !314, !"\01?HitMirror@@YAXUPayload@@V?$vector@M$01@@@Z: %payload"}
!314 = distinct !{!314, !"\01?HitMirror@@YAXUPayload@@V?$vector@M$01@@@Z"}
!315 = !DILocation(line: 130, column: 9, scope: !78, inlinedAt: !249)
!316 = !DILocation(line: 132, column: 9, scope: !317, inlinedAt: !249)
!317 = distinct !DILexicalBlock(scope: !311, file: !1, line: 131, column: 5)
!318 = !DILocation(line: 136, column: 18, scope: !78, inlinedAt: !249)
!319 = !DILocation(line: 136, column: 37, scope: !78, inlinedAt: !249)
!320 = !DILocation(line: 136, column: 59, scope: !78, inlinedAt: !249)
!321 = !DILocation(line: 136, column: 57, scope: !78, inlinedAt: !249)
!322 = !DILocation(line: 136, column: 35, scope: !78, inlinedAt: !249)
!323 = !DILocation(line: 136, column: 12, scope: !78, inlinedAt: !249)
!324 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !78, file: !1, line: 136, type: !4)
!325 = !DILocation(line: 137, column: 62, scope: !78, inlinedAt: !249)
!326 = !DILocation(line: 137, column: 31, scope: !78, inlinedAt: !249)
!327 = !DILocation(line: 137, column: 21, scope: !78, inlinedAt: !249)
!328 = !DILocation(line: 137, column: 12, scope: !78, inlinedAt: !249)
!329 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "normal", scope: !78, file: !1, line: 137, type: !4)
!330 = !DILocation(line: 140, column: 42, scope: !78, inlinedAt: !249)
!331 = !DILocation(line: 140, column: 32, scope: !78, inlinedAt: !249)
!332 = !DILocation(line: 140, column: 24, scope: !78, inlinedAt: !249)
!333 = !DILocation(line: 140, column: 12, scope: !78, inlinedAt: !249)
!334 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reflected", scope: !78, file: !1, line: 140, type: !4)
!335 = !DILocation(line: 144, column: 15, scope: !78, inlinedAt: !249)
!336 = !DILocation(line: 144, column: 22, scope: !78, inlinedAt: !249)
!337 = !DILocation(line: 145, column: 15, scope: !78, inlinedAt: !249)
!338 = !DILocation(line: 145, column: 25, scope: !78, inlinedAt: !249)
!339 = !DILocation(line: 146, column: 15, scope: !78, inlinedAt: !249)
!340 = !DILocation(line: 146, column: 20, scope: !78, inlinedAt: !249)
!341 = !DILocation(line: 147, column: 15, scope: !78, inlinedAt: !249)
!342 = !DILocation(line: 147, column: 20, scope: !78, inlinedAt: !249)
!343 = !DILocation(line: 150, column: 13, scope: !78, inlinedAt: !249)
!344 = !DILocation(line: 150, column: 29, scope: !78, inlinedAt: !249)
!345 = !DILocation(line: 153, column: 5, scope: !78, inlinedAt: !249)
!346 = !DILocation(line: 154, column: 1, scope: !78, inlinedAt: !249)
!347 = !DILocation(line: 94, column: 13, scope: !235)
!348 = !DILocation(line: 96, column: 13, scope: !235)
!349 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !79, file: !1, line: 157, type: !56)
!350 = !DILocation(line: 157, column: 29, scope: !79, inlinedAt: !234)
!351 = !DILocation(line: 159, column: 18, scope: !79, inlinedAt: !234)
!352 = !DILocation(line: 159, column: 37, scope: !79, inlinedAt: !234)
!353 = !DILocation(line: 159, column: 59, scope: !79, inlinedAt: !234)
!354 = !DILocation(line: 159, column: 57, scope: !79, inlinedAt: !234)
!355 = !DILocation(line: 159, column: 35, scope: !79, inlinedAt: !234)
!356 = !DILocation(line: 159, column: 12, scope: !79, inlinedAt: !234)
!357 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !79, file: !1, line: 159, type: !4)
!358 = !DILocation(line: 162, column: 21, scope: !79, inlinedAt: !234)
!359 = !DILocation(line: 162, column: 34, scope: !79, inlinedAt: !234)
!360 = !DILocation(line: 162, column: 11, scope: !79, inlinedAt: !234)
!361 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pattern", scope: !79, file: !1, line: 162, type: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool2", file: !1, line: 162, baseType: !363)
!363 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<bool, 2>", file: !1, line: 162, size: 64, align: 32, elements: !364, templateParams: !367)
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !363, file: !1, line: 162, baseType: !60, size: 32, align: 32, flags: DIFlagPublic)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !363, file: !1, line: 162, baseType: !60, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!367 = !{!368, !73}
!368 = !DITemplateTypeParameter(name: "element", type: !60)
!369 = !DILocation(line: 163, column: 22, scope: !79, inlinedAt: !234)
!370 = !DILocation(line: 163, column: 34, scope: !79, inlinedAt: !234)
!371 = !DILocation(line: 163, column: 32, scope: !79, inlinedAt: !234)
!372 = !DILocation(line: 163, column: 21, scope: !79, inlinedAt: !234)
!373 = !DILocation(line: 163, column: 13, scope: !79, inlinedAt: !234)
!374 = !DILocation(line: 163, column: 19, scope: !79, inlinedAt: !234)
!375 = !DILocation(line: 167, column: 15, scope: !79, inlinedAt: !234)
!376 = !DILocation(line: 167, column: 22, scope: !79, inlinedAt: !234)
!377 = !DILocation(line: 168, column: 27, scope: !79, inlinedAt: !234)
!378 = !DILocation(line: 168, column: 33, scope: !79, inlinedAt: !234)
!379 = !DILocation(line: 168, column: 15, scope: !79, inlinedAt: !234)
!380 = !DILocation(line: 168, column: 25, scope: !79, inlinedAt: !234)
!381 = !DILocation(line: 169, column: 15, scope: !79, inlinedAt: !234)
!382 = !DILocation(line: 169, column: 20, scope: !79, inlinedAt: !234)
!383 = !DILocation(line: 170, column: 15, scope: !79, inlinedAt: !234)
!384 = !DILocation(line: 170, column: 20, scope: !79, inlinedAt: !234)
!385 = !DILocation(line: 174, column: 12, scope: !79, inlinedAt: !234)
!386 = !DILocation(line: 174, column: 28, scope: !79, inlinedAt: !234)
!387 = !DILocation(line: 175, column: 12, scope: !79, inlinedAt: !234)
!388 = !DILocation(line: 175, column: 19, scope: !79, inlinedAt: !234)
!389 = !DILocation(line: 179, column: 17, scope: !390, inlinedAt: !234)
!390 = distinct !DILexicalBlock(scope: !79, file: !1, line: 179, column: 9)
!391 = !DILocation(line: 179, column: 9, scope: !79, inlinedAt: !234)
!392 = !DILocation(line: 181, column: 17, scope: !393, inlinedAt: !234)
!393 = distinct !DILexicalBlock(scope: !390, file: !1, line: 180, column: 5)
!394 = !DILocation(line: 181, column: 23, scope: !393, inlinedAt: !234)
!395 = !DILocation(line: 182, column: 5, scope: !393, inlinedAt: !234)
!396 = !DILocation(line: 183, column: 1, scope: !79, inlinedAt: !234)
!397 = !DILocation(line: 97, column: 13, scope: !235)
!398 = !DILocation(line: 99, column: 21, scope: !235)
!399 = !DILocation(line: 99, column: 27, scope: !235)
!400 = !DILocation(line: 100, column: 13, scope: !235)
!401 = !DILocation(line: 102, column: 1, scope: !62)

#endif

const unsigned char compiledShader[] = {
  0x44, 0x58, 0x42, 0x43, 0x81, 0x7f, 0x84, 0x9e, 0x94, 0x99, 0x5c, 0xd6,
  0xac, 0xac, 0x62, 0x27, 0x59, 0x87, 0x5f, 0x75, 0x01, 0x00, 0x00, 0x00,
  0xc4, 0x79, 0x00, 0x00, 0x07, 0x00, 0x00, 0x00, 0x3c, 0x00, 0x00, 0x00,
  0x4c, 0x00, 0x00, 0x00, 0x14, 0x02, 0x00, 0x00, 0xac, 0x57, 0x00, 0x00,
  0x74, 0x62, 0x00, 0x00, 0xa8, 0x62, 0x00, 0x00, 0xc4, 0x62, 0x00, 0x00,
  0x53, 0x46, 0x49, 0x30, 0x08, 0x00, 0x00, 0x00, 0x05, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x52, 0x44, 0x41, 0x54, 0xc0, 0x01, 0x00, 0x00,
  0x10, 0x00, 0x00, 0x00, 0x04, 0x00, 0x00, 0x00, 0x18, 0x00, 0x00, 0x00,
  0xc0, 0x00, 0x00, 0x00, 0x10, 0x01, 0x00, 0x00, 0xa4, 0x01, 0x00, 0x00,
  0x01, 0x00, 0x00, 0x00, 0xa0, 0x00, 0x00, 0x00, 0x00, 0x73, 0x63, 0x65,
  0x6e, 0x65, 0x00, 0x75, 0x61, 0x76, 0x00, 0x01, 0x3f, 0x52, 0x61, 0x79,
  0x47, 0x65, 0x6e, 0x65, 0x72, 0x61, 0x74, 0x69, 0x6f, 0x6e, 0x40, 0x40,
  0x59, 0x41, 0x58, 0x58, 0x5a, 0x00, 0x52, 0x61, 0x79, 0x47, 0x65, 0x6e,
  0x65, 0x72, 0x61, 0x74, 0x69, 0x6f, 0x6e, 0x00, 0x01, 0x3f, 0x4d, 0x69,
  0x73, 0x73, 0x40, 0x40, 0x59, 0x41, 0x58, 0x55, 0x50, 0x61, 0x79, 0x6c,
  0x6f, 0x61, 0x64, 0x40, 0x40, 0x40, 0x5a, 0x00, 0x4d, 0x69, 0x73, 0x73,
  0x00, 0x01, 0x3f, 0x43, 0x6c, 0x6f, 0x73, 0x65, 0x73, 0x74, 0x48, 0x69,
  0x74, 0x40, 0x40, 0x59, 0x41, 0x58, 0x55, 0x50, 0x61, 0x79, 0x6c, 0x6f,
  0x61, 0x64, 0x40, 0x40, 0x55, 0x42, 0x75, 0x69, 0x6c, 0x74, 0x49, 0x6e,
